BAS BMEKZU Project/src/InformationRegisters/СтатусыПлательщиковЕдиногоНалога/СтатусыПлательщиковЕдиногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПлательщиковЕдиногоНалога</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикЕдиногоНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаПлательщикаЕдиногоНалога</name>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/УчетнаяПолитикаОрганизаций/УчетнаяПолитикаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВестиУчетДенежныхСредствПоОбособленнымПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВключатьСуммуДооценокОСВСоставНП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаПлательщикаЕдиногоНалога</name>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>ИнформацияОСтатусеПлательщикаНалогов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользуемыеКлассыСчетовРасходов</name>
    <type>
      <types>EnumRef.КлассыСчетовРасходов</types>
    </type>
  </resources>
  <resources>
    <name>НалогНаПрибыльБезКорректировокФинансовогоРезультата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НалогНаПрибыльКонсолидированно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НалоговоеНазначениеНераспределенныхПостоянныхОПЗ</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </resources>
  <resources>
    <name>НеРаспределятьОПЗнаСебестоимостьПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикЕдиногоНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг</name>
    <type>
      <types>EnumRef.ПорядокРаспределенияРасходовНаОказаниеВнутреннихУслуг</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокРаспределенияРасходовНаОказаниеУслуг</name>
    <type>
      <types>EnumRef.ПорядокРаспределенияРасходовНаОказаниеУслуг</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиМПЗ</name>
    <type>
      <types>EnumRef.СпособыОценки</types>
    </type>
  </resources>
  <resources>
    <name>СпособОценкиТоваровВРознице</name>
    <type>
      <types>EnumRef.СпособыОценкиТоваровВРознице</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаСебестоимостиПроизводства</name>
    <type>
      <types>EnumRef.СпособыРасчетаСебестоимостиПродукции</types>
    </type>
  </resources>
  <resources>
    <name>СхемаНалогообложения</name>
    <type>
      <types>CatalogRef.СхемыНалогообложения</types>
    </type>
  </resources>
  <resources>
    <name>УвеличиватьСтоимостьОСНаСуммуУлучшенияВПорядкеНКУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиДневнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиМесячнуюНумерациюНалоговыхДокументов</name>
    <comment>Возможность вести нумерацию Налоговых накладных и Приложений 2 с № 1 каждый месяц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений</name>
    <comment>Возможность вести нумерацию налоговых документов без учета обособленных подразделений, в случае, когда обособленные подразделения указаны в документах</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументов</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям</name>
    <comment>Технологические налоговые документы &quot;Не НДС&quot; не будут занимать номера обычных налоговых</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхДокументовПоСпецРежимам</name>
    <comment>Разные нумераторы для Налоговой накладной и Приложения 2 к налоговой накладной для разных спец. режимов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВестиРаздельнуюНумерациюНалоговыхНакладныхПоОбычнымЦенам</name>
    <comment>Будут ли налоговые накладные по ОЦ занимать номер налогой накладной или будут иметь тот же номер, что и основаная налоговая (но тип причины невыдачи = 01)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьВыводитьНомерДоговораБезКлеточек</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьДополнятьНаименованиеАдресДаннымиГоловнойОрганизацииВНН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьНеДополнятьНаименованиеНомеромГТДВНалоговыхДокументах</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПечататьДатыВНалоговыхНакладныхСРазделителями</name>
    <comment>только для формы по приказу 1379</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПечататьКодУКТВЭДБезПробелов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПечататьТитульныйЛистДляПриложения2КНалоговойНакладной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьСимволПустыхПоказателейВНалоговойНакладной</name>
    <comment>Чем заполнять пустые показатели (с 2011 г.): Знаком &quot;X&quot;, &quot;-&quot;, или пустой строкой, например</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВыгрузкаПечатьНН_ПоФормеНаДатуДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <attributes>
    <name>БанковскийСчетДляРасчетовСФСС</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияЗвит1С</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>Код ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксБ12</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФайлЛоготип</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФайлФаксимильнаяПодпись</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНАГРО_ДатаВключенияПоДотации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЛоготип</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПодпись</name>
    <type>
      <types>CatalogRef.ОрганизацииПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКонтактнойИнформации</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/InformationRegisters/СтатусыПлательщиковЕдиногоНалога/ManagerModule.bsl
Процедура АктуализироватьДанные(НаборЗаписейУчетнойПолитики) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтборПоОрганизации = Неопределено;
	Если НаборЗаписейУчетнойПолитики.Отбор.Найти("Организация") <> Неопределено И НаборЗаписейУчетнойПолитики.Отбор.Организация.Использование Тогда
		ОтборПоОрганизации = НаборЗаписейУчетнойПолитики.Отбор.Организация.Значение;
	КонецЕсли;
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	УчетнаяПолитикаОрганизаций.ПлательщикЕдиногоНалога КАК ПлательщикЕдиногоНалога,
	|	УчетнаяПолитикаОрганизаций.ГруппаПлательщикаЕдиногоНалога КАК ГруппаПлательщикаЕдиногоНалога,
	|	УчетнаяПолитикаОрганизаций.ДатаИзмененияСхемыНалогообложенияВСерединеМесяца КАК ДатаИзмененияСхемыНалогообложенияВСерединеМесяца,
	|	УчетнаяПолитикаОрганизаций.Период КАК Период
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО Организации.Ссылка = УчетнаяПолитикаОрганизаций.Организация
	|{ГДЕ
	|	Организации.Ссылка.* КАК Организация}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|ИТОГИ ПО
	|	Организация";
	
	Если ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		Запрос.Отбор.Добавить("Организация").Установить(ОтборПоОрганизации);
	КонецЕсли;
	
	Запрос.Выполнить();
	ВыборкаОрганизация = Запрос.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.СтатусыПлательщиковЕдиногоНалога.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаОрганизация.Организация);
		
		ТекущийСтатусПлательщика = Неопределено;
		ДатаПоследнегоИзменения = Неопределено;
		ТекущаяГруппаЕН = Неопределено;
		
		Выборка = ВыборкаОрганизация.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.Период) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДатаИзмененияСхемыНалогообложенияВСерединеМесяца) Тогда
				ДатаВыборки = Мин(Выборка.Период, Выборка.ДатаИзмененияСхемыНалогообложенияВСерединеМесяца);
			Иначе         
				ДатаВыборки = Выборка.Период;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДатаПоследнегоИзменения) И ДатаВыборки >= ДатаПоследнегоИзменения Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТекущийСтатусПлательщика <> Выборка.ПлательщикЕдиногоНалога ИЛИ ТекущаяГруппаЕН <> Выборка.ГруппаПлательщикаЕдиногоНалога Тогда
				
				ТекущийСтатусПлательщика = Выборка.ПлательщикЕдиногоНалога;
				ТекущаяГруппаЕН = Выборка.ГруппаПлательщикаЕдиногоНалога;
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ДатаВыборки;
				НоваяЗапись.Организация = ВыборкаОрганизация.Организация;
				НоваяЗапись.ПлательщикЕдиногоНалога = ТекущийСтатусПлательщика;
				НоваяЗапись.ГруппаПлательщикаЕдиногоНалога = ТекущаяГруппаЕН;
				
			Иначе
				
				Если ДатаВыборки < ДатаПоследнегоИзменения Тогда
					НоваяЗапись.Период = ДатаВыборки;
				КонецЕсли;
				
			КонецЕсли;
			
			ДатаПоследнегоИзменения = ДатаВыборки;	
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры
